MaierN/fpLED/tests_technologiques/platformio-stm32-test/src/leds/leds.c

#include <stdbool.h>

#include "stm32f1xx_hal.h"

#include "leds.h"

#include "exception_handler/exception_handler.h"

#define ARRAY_SIZE(a) (sizeof(a) / sizeof(a[0]))

#define LED_PORT GPIOA
#define LED_PORT_ENABLE __HAL_RCC_GPIOA_CLK_ENABLE

#define LED_N 256      // number of led in each slice
#define LED_BYTE_N 3 // number of byte in each led

#define TIM_2_PERIOD (SystemCoreClock / 800000) // 1250 [ns] period = 1/800000 [s]

#define LED_RESET_PERIOD_COUNT 50

TIM_HandleTypeDef tim_2;
TIM_OC_InitTypeDef tim_2_oc_0;
TIM_OC_InitTypeDef tim_2_oc_1;

DMA_HandleTypeDef dma_up;
DMA_HandleTypeDef dma_down_0;
DMA_HandleTypeDef dma_down_1;

uint8_t strip_pins[] = {GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3, GPIO_PIN_4};
uint32_t all_pins[] = {0xffffffff}; // mask to select every pin
uint8_t led_bit_buffer[8 * LED_BYTE_N * LED_N];

uint32_t reset_counter = 0;

static void send() {
    // clear all DMA flags
    __HAL_DMA_CLEAR_FLAG(&dma_up, DMA_FLAG_TC2 | DMA_FLAG_HT2 | DMA_FLAG_TE2);
    __HAL_DMA_CLEAR_FLAG(&dma_down_0, DMA_FLAG_TC5 | DMA_FLAG_HT5 | DMA_FLAG_TE5);
    __HAL_DMA_CLEAR_FLAG(&dma_down_1, DMA_FLAG_TC7 | DMA_FLAG_HT7 | DMA_FLAG_TE7);

    // configure the number of bytes to be transferred by the DMA controller
    dma_up.Instance->CNDTR = ARRAY_SIZE(led_bit_buffer);
    dma_down_0.Instance->CNDTR = ARRAY_SIZE(led_bit_buffer);
    dma_down_1.Instance->CNDTR = ARRAY_SIZE(led_bit_buffer);

    // clear all TIM2 flags
    __HAL_TIM_CLEAR_FLAG(&tim_2, TIM_FLAG_UPDATE | TIM_FLAG_CC1 | TIM_FLAG_CC2 | TIM_FLAG_CC3 | TIM_FLAG_CC4);

    __HAL_DMA_ENABLE(&dma_up);
    __HAL_DMA_ENABLE(&dma_down_0);
    __HAL_DMA_ENABLE(&dma_down_1);

    __HAL_TIM_ENABLE_DMA(&tim_2, TIM_DMA_UPDATE);
    __HAL_TIM_ENABLE_DMA(&tim_2, TIM_DMA_CC1);
    __HAL_TIM_ENABLE_DMA(&tim_2, TIM_DMA_CC2);

    TIM2->CNT = TIM_2_PERIOD - 1;

    __HAL_TIM_ENABLE(&tim_2);
}

static void dma_transfer_complete_handler(DMA_HandleTypeDef *dma_handle) {
    // disable DMA transfer
    __HAL_DMA_DISABLE(&dma_up);
    __HAL_DMA_DISABLE(&dma_down_0);
    __HAL_DMA_DISABLE(&dma_down_1);

    // disable DMA requests of TIM2
    __HAL_TIM_DISABLE_DMA(&tim_2, TIM_DMA_UPDATE);
    __HAL_TIM_DISABLE_DMA(&tim_2, TIM_DMA_CC1);
    __HAL_TIM_DISABLE_DMA(&tim_2, TIM_DMA_CC2);

    // enable TIM2 update interrupts (will be used to time the RST signal > 50 us)
    __HAL_TIM_ENABLE_IT(&tim_2, TIM_IT_UPDATE);

    // set pin to low, for RST signal
    LED_PORT->BRR = all_pins[0];
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
    // wait 50 us for RST signal
    if (reset_counter < LED_RESET_PERIOD_COUNT) {
        reset_counter++;
    } else {
        reset_counter = 0;
        // disable timer
        __HAL_TIM_DISABLE(&tim_2);
        TIM2->CR1 = 0;

        // disable TIM2 update interrupts
        __HAL_TIM_DISABLE_IT(&tim_2, TIM_IT_UPDATE);

        // todo test
        send();
    }
}

void DMA1_Channel7_IRQHandler(void) {
    // clear flags, and call appropriate callbacks
    HAL_DMA_IRQHandler(&dma_down_1);
}

void TIM2_IRQHandler(void) {
    // clear flags, and call appropriate callbacks
    HAL_TIM_IRQHandler(&tim_2);
}

static void leds_gpio_init() {
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    LED_PORT_ENABLE();

    uint8_t all_pins = 0x0;
    for (size_t i = 0; i < ARRAY_SIZE(strip_pins); i++) {
        all_pins |= strip_pins[i];
    }
    HAL_GPIO_WritePin(LED_PORT, all_pins, GPIO_PIN_RESET);

    GPIO_InitStruct.Pin = all_pins;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_PORT, &GPIO_InitStruct);
}

static void leds_dma_init() {
    __HAL_RCC_DMA1_CLK_ENABLE();

    // TIM2 Update: dma up
    dma_up.Instance = DMA1_Channel2;
    dma_up.Init.Direction = DMA_MEMORY_TO_PERIPH;
    dma_up.Init.PeriphInc = DMA_PINC_DISABLE;
    dma_up.Init.MemInc = DMA_MINC_DISABLE;
    dma_up.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    dma_up.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
    dma_up.Init.Mode = DMA_CIRCULAR;
    dma_up.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&dma_up);
    HAL_DMA_Start(&dma_up, (uint32_t)all_pins, (uint32_t)&LED_PORT->BSRR, ARRAY_SIZE(led_bit_buffer));

    // TIM2 CC1: dma down (0 bit)
    dma_down_0.Instance = DMA1_Channel5;
    dma_down_0.Init.Direction = DMA_MEMORY_TO_PERIPH;
    dma_down_0.Init.PeriphInc = DMA_PINC_DISABLE;
    dma_down_0.Init.MemInc = DMA_MINC_ENABLE;
    dma_down_0.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    dma_down_0.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    dma_down_0.Init.Mode = DMA_CIRCULAR;
    dma_down_0.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&dma_down_0);
    HAL_DMA_Start(&dma_down_0, (uint32_t)led_bit_buffer, (uint32_t)&LED_PORT->BRR, ARRAY_SIZE(led_bit_buffer));

    // TIM2 CC2: dma down (1 bit)
    dma_down_1.Instance = DMA1_Channel7;
    dma_down_1.Init.Direction = DMA_MEMORY_TO_PERIPH;
    dma_down_1.Init.PeriphInc = DMA_PINC_DISABLE;
    dma_down_1.Init.MemInc = DMA_MINC_DISABLE;
    dma_down_1.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    dma_down_1.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
    dma_down_1.Init.Mode = DMA_CIRCULAR;
    dma_down_1.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&dma_down_1);
    dma_down_1.XferCpltCallback = dma_transfer_complete_handler;
    HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel7_IRQn);
    HAL_DMA_Start_IT(&dma_down_1, (uint32_t)all_pins, (uint32_t)&LED_PORT->BRR, ARRAY_SIZE(led_bit_buffer));
}

static void leds_timer_init() {
    __HAL_RCC_TIM2_CLK_ENABLE();

    tim_2.Instance = TIM2;
    tim_2.Init.Period = TIM_2_PERIOD;
    tim_2.Init.Prescaler = 0;
    tim_2.Init.RepetitionCounter = 0;
    tim_2.Init.CounterMode = TIM_COUNTERMODE_UP;
    tim_2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    tim_2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

    HAL_TIM_PWM_Init(&tim_2);

    HAL_NVIC_SetPriority(TIM2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);

    tim_2_oc_0.OCMode = TIM_OCMODE_PWM1;
    tim_2_oc_0.OCPolarity = TIM_OCPOLARITY_HIGH;
    tim_2_oc_0.Pulse = TIM_2_PERIOD * 32 / 100; // ws2812b datasheet -> ~ 400 ns high time for '0' bit
    tim_2_oc_0.OCFastMode = TIM_OCFAST_DISABLE;
    HAL_TIM_PWM_ConfigChannel(&tim_2, &tim_2_oc_0, TIM_CHANNEL_1);

    tim_2_oc_1.OCMode = TIM_OCMODE_PWM1;
    tim_2_oc_1.OCPolarity = TIM_OCPOLARITY_HIGH;
    tim_2_oc_1.Pulse = TIM_2_PERIOD * 64 / 100; // ws2812b datasheet -> ~ 800 ns high time for '1' bit
    tim_2_oc_1.OCFastMode = TIM_OCFAST_DISABLE;
    HAL_TIM_PWM_ConfigChannel(&tim_2, &tim_2_oc_1, TIM_CHANNEL_2);

    HAL_TIM_Base_Start(&tim_2);
    HAL_TIM_PWM_Start(&tim_2, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&tim_2, TIM_CHANNEL_2);
}

void leds_set_pixel(size_t strip, size_t pixel, uint8_t r, uint8_t g, uint8_t b) {
    size_t index = pixel * LED_BYTE_N * 8;

    for (int i = 0; i < 8; i++) {
        uint8_t pin = strip_pins[strip];

        // put 1 to send 0 bit, put 0 to send 1 bit

        if ((g >> (7-i)) & 0x1) led_bit_buffer[index + i + 0*8] &= ~pin;
        else led_bit_buffer[index + i + 0*8] |= pin;
        
        if ((r >> (7-i)) & 0x1) led_bit_buffer[index + i + 1*8] &= ~pin;
        else led_bit_buffer[index + i + 1*8] |= pin;
        
        if ((b >> (7-i)) & 0x1) led_bit_buffer[index + i + 2*8] &= ~pin;
        else led_bit_buffer[index + i + 2*8] |= pin;
    }
}

void leds_init() {
    for (size_t i = 0; i < ARRAY_SIZE(led_bit_buffer); i++) {
        led_bit_buffer[i] = 0xff;
    }

    leds_gpio_init();
    HAL_Delay(1000);

    leds_dma_init();
    leds_timer_init();

    send();

    /*size_t i = 0;
    while (1) {
        size_t next_i = (i + 1) % LED_N;
        set_pixel(0, next_i, 4, 4, 0);
        set_pixel(0, i, 0, 0, 0);
        i = next_i;
        HAL_Delay(1000/16);
    }*/
}
